[Timeout] EqualityOperator
src/triangulo.ts:2:29
 export function classificarTriangulo(a: number, b: number, c: number): string {
-    if (a <= 0 || b <= 0 || c <= 0) {
+    if (a <= 0 || b <= 0 || c < 0) {
       return "Valores inválidos para um triângulo";
     }

[Timeout] EqualityOperator
src/triangulo.ts:6:37
       return "Valores inválidos para um triângulo";
     }
   
-    if (a + b <= c || a + c <= b || b + c <= a) {
+    if (a + b <= c || a + c <= b || b + c < a) {
       return "Não é um triângulo";
     }
