[Timeout] BlockStatement
src/main.ts:3:17
 import { classificarTriangulo } from "./triangulo";
 
-function main() {
-  const lados = [3, 3, 3];
-  const [a, b, c] = lados;
-
-  console.log(`Os lados são: ${a}, ${b}, ${c}`);
-  console.log(`Classificação: ${classificarTriangulo(a, b, c)}`);
-}
+function main() {}
 
 main();

[Timeout] StringLiteral
src/main.ts:8:15
   const [a, b, c] = lados;
 
   console.log(`Os lados são: ${a}, ${b}, ${c}`);
-  console.log(`Classificação: ${classificarTriangulo(a, b, c)}`);
+  console.log(``);
 }
 
