[Killed] BlockStatement
src/triangulo.ts:1:79
-export function classificarTriangulo(a: number, b: number, c: number): string {
-    if (a <= 0 || b <= 0 || c <= 0) {
-      return "Valores inválidos para um triângulo";
-    }
-  
-    if (a + b <= c || a + c <= b || b + c <= a) {
-      return "Não é um triângulo";
-    }
-  
-    if (a === b && b === c) {
-      return "Equilátero";
-    } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
-      return "Isósceles";
-    } else {
-      return "Escaleno";
-    }
-  }
+export function classificarTriangulo(a: number, b: number, c: number): string {}
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: undefined

[Killed] EqualityOperator
src/triangulo.ts:2:19
 export function classificarTriangulo(a: number, b: number, c: number): string {
-    if (a <= 0 || b <= 0 || c <= 0) {
+    if (a <= 0 || b > 0 || c <= 0) {
       return "Valores inválidos para um triângulo";
     }
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: "Valores inválidos para um triângulo"

[Killed] LogicalOperator
src/triangulo.ts:2:9
 export function classificarTriangulo(a: number, b: number, c: number): string {
-    if (a <= 0 || b <= 0 || c <= 0) {
+    if ((a <= 0 || b <= 0) && c <= 0) {
       return "Valores inválidos para um triângulo";
     }
killedBy: Testes da função classificarTriangulo Deve retornar 'Valores inválidos para um triângulo' para valores menores ou iguais a zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Valores inválidos para um triângulo"
Received: "Não é um triângulo"

[Killed] StringLiteral
src/triangulo.ts:3:14
 export function classificarTriangulo(a: number, b: number, c: number): string {
     if (a <= 0 || b <= 0 || c <= 0) {
-      return "Valores inválidos para um triângulo";
+      return "";
     }
   
killedBy: Testes da função classificarTriangulo Deve retornar 'Valores inválidos para um triângulo' para valores menores ou iguais a zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Valores inválidos para um triângulo"
Received: ""

[Killed] ArithmeticOperator
src/triangulo.ts:6:37
       return "Valores inválidos para um triângulo";
     }
   
-    if (a + b <= c || a + c <= b || b + c <= a) {
+    if (a + b <= c || a + c <= b || b - c <= a) {
       return "Não é um triângulo";
     }
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: "Não é um triângulo"

[Killed] EqualityOperator
src/triangulo.ts:6:23
       return "Valores inválidos para um triângulo";
     }
   
-    if (a + b <= c || a + c <= b || b + c <= a) {
+    if (a + b <= c || a + c > b || b + c <= a) {
       return "Não é um triângulo";
     }
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: "Não é um triângulo"

[Killed] EqualityOperator
src/triangulo.ts:10:20
       return "Não é um triângulo";
     }
   
-    if (a === b && b === c) {
+    if (a === b && b !== c) {
       return "Equilátero";
     } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: "Escaleno"

[Killed] EqualityOperator
src/triangulo.ts:10:9
       return "Não é um triângulo";
     }
   
-    if (a === b && b === c) {
+    if (a !== b && b === c) {
       return "Equilátero";
     } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: "Escaleno"

[Killed] StringLiteral
src/triangulo.ts:11:14
     }
   
     if (a === b && b === c) {
-      return "Equilátero";
+      return "";
     } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
       return "Isósceles";
killedBy: Testes da função classificarTriangulo Deve retornar 'Equilátero' para lados iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilátero"
Received: ""

[Killed] ConditionalExpression
src/triangulo.ts:12:17
   
     if (a === b && b === c) {
       return "Equilátero";
-    } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
+    } else if ((false) || (b === c && c !== a ) || (a === c && c !== b)) {
       return "Isósceles";
     } else {
killedBy: Testes da função classificarTriangulo Deve retornar 'Isósceles' para dois lados iguais e um lado diferente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Isósceles"
Received: "Escaleno"

[Killed] ConditionalExpression
src/triangulo.ts:12:66
   
     if (a === b && b === c) {
       return "Equilátero";
-    } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
+    } else if ((a === b && b !== c) || (b === c && c !== a ) || (true && c !== b)) {
       return "Isósceles";
     } else {
killedBy: Testes da função classificarTriangulo Deve retornar 'Escaleno' para lados diferentes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Escaleno"
Received: "Isósceles"

[Killed] BlockStatement
src/triangulo.ts:14:12
       return "Equilátero";
     } else if ((a === b && b !== c) || (b === c && c !== a ) || (a === c && c !== b)) {
       return "Isósceles";
-    } else {
-      return "Escaleno";
-    }
+    } else {}
   }
killedBy: Testes da função classificarTriangulo Deve retornar 'Escaleno' para lados diferentes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Escaleno"
Received: undefined
